Revit 2027 API
SpatialFieldManager.IsTextTypeIdValid Method
 Verify if text type id is valid.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsTextTypeIdValid(
	ElementId textTypeId,
	Document doc
)
Public Shared Function IsTextTypeIdValid (
	textTypeId As ElementId,
	doc As Document
) As Boolean
public:
static bool IsTextTypeIdValid(
	ElementId^ textTypeId,
	Document^ doc
)
static member IsTextTypeIdValid :
        textTypeId : ElementId *
        doc : Document -> bool
Parameters
textTypeId ElementId
 Text type id to be validated.
doc Document
 Document for which %textTypeId% is validated.
Return Value
Boolean
 True if text type id is valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace